Изменения типовой конфигурации/src/Catalogs/Изм_ТехническиеПроекты/Изм_ТехническиеПроекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Изм_ТехническиеПроекты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПолноеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрименения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Изм_СтатусыТехническихПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.Изм_ИнформационныеБазы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзмененныеМетаданные</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ссылки</name>
    <attributes>
      <name>АдресСсылки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСсылки</name>
      <type>
        <types>CatalogRef.Изм_ТипыСсылок</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Изменения типовой конфигурации/src/CommonModules/Изм_ПодключаемыеКомандыВызовСервера/Module.bsl
Функция ЭтоИзмененныеМетаданные(ИдентификаторМетаданных) Экспорт
     УстановитьПривилегированныйРежим(Истина);
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1 
		|	Истина 
		|ИЗ
		|	Справочник.Изм_ТехническиеПроекты.ИзмененныеМетаданные КАК Изм_ТехническиеПроектыИзмененныеМетаданные
		|ГДЕ
		|	Изм_ТехническиеПроектыИзмененныеМетаданные.ОбъектМетаданных = &ОбъектМетаданных";
	
	Запрос.УстановитьПараметр("ОбъектМетаданных", ИдентификаторМетаданных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
КонецФункции // ()
